package main

import (
	"patterns/code"
)

// Адаптер - это когда адаптируешь метод под структуру которая его не может сама исполнять. адаптер по итогу реализует интерфейс

// Здесь - у нас есть мак и какойто ноут на винде. У мака квадратный разъем а у винды круглый.
// У нас есть провод (торчит из стены) тока с квадратным разъемом
// Мак мы подключим без проблем, а вот для винды нужен переходник (то есть наш адаптер)
// Адаптеру придется реализовать метод (что он тип квадратно разъемный) специально для винды (сожержит ее адрес)

func main() {
	cl := code.NewClient()
	mac := code.NewMac()
	win := code.NewWin()
	adapterWin := code.NewAdapter(win)
	cl.InsertInSquareUSB(mac)
	cl.InsertInSquareUSB(adapterWin)
}
